src/Catalogs/СтатусыЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СтатусыЗаявки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КадровыеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СтатусыЗаявки/Ext/ManagerModule.bsl
Функция ПолучитьСтатусОтмена() Экспорт
	
	Возврат Справочники.СтатусыЗаявки.НайтиПоКоду("000");
	
КонецФункции

Функция ПолучитьСтатусНачало() Экспорт
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	СтатусыЗаявки.Ссылка
	//|ИЗ
	//|	Справочник.СтатусыЗаявки КАК СтатусыЗаявки
	//|ГДЕ
	//|	НЕ СтатусыЗаявки.Ссылка В
	//|				(ВЫБРАТЬ
	//|					СтатусыЗаявки.Следующий.Ссылка
	//|				ИЗ
	//|					Справочник.СтатусыЗаявки КАК СтатусыЗаявки
	//|				ГДЕ
	//|					СтатусыЗаявки.Следующий <> ЗНАЧЕНИЕ(Справочник.СтатусыЗаявки.ПустаяСсылка))
	//|	И ""000"" < СтатусыЗаявки.Код
	//|	И СтатусыЗаявки.Код < ""900"""
	//);
	//
	//Результат = Запрос.Выполнить();
	//
	//Если Результат.Пустой() Тогда
	//	Возврат Справочники.СтатусыЗаявки.ПустаяСсылка();
	//КонецЕсли;
	//
	//Выборка = Результат.Выбрать();
	//Выборка.Следующий();
	//
	//Возврат Выборка.Ссылка;
	
	Возврат Справочники.СтатусыЗаявки.НайтиПоКоду("001");
	
КонецФункции

Функция ПолучитьСтатусФиниша() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыЗаявки.Следующий.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыЗаявки КАК СтатусыЗаявки
	|ГДЕ
	|	СтатусыЗаявки.Следующий.Следующий = ЗНАЧЕНИЕ(Справочник.СтатусыЗаявки.ПустаяСсылка)
	|	И ""000"" < СтатусыЗаявки.Следующий.Код
	|	И СтатусыЗаявки.Следующий.Код < ""900"""
	);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.СтатусыЗаявки.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьСтатусЗакрыт(ПолностьюЗакрыт=Истина) Экспорт
	
	Возврат Справочники.СтатусыЗаявки.НайтиПоКоду(?(ПолностьюЗакрыт, "999", "900"));
	
КонецФункции

Функция ПроверитьДоступСтатуса(Статус, Пользователь=Неопределено, Ответственный=Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Статус = ПолучитьСтатусНачало() И Ответственный <> Неопределено Тогда	//-= при формировании документа
		Возврат Пользователь = Ответственный;									//-= может редактировать ТОЛЬКО ответственный
	КонецЕсли;
	
	Данные = глОбщий.ПолучитьСотрудникаПоФизЛицу(Пользователь.ФизЛицо, ТекущаяДата());
	
	Должность = Данные.Должность;
	Подразделение = Данные.ПодразделениеОрганизации;		
	
	ЕстьДоступ = Ложь;
	
	Если Статус.КадровыеДанные.Количество() = 0 И Статус.Пользователи.Количество()=0 Тогда
		ЕстьДоступ = Истина;
	КонецЕсли;
	
	Если Не ЕстьДоступ И Статус.Пользователи.Количество()>0 Или Статус.Пользователи.Найти(Пользователь, "Пользователь") <> Неопределено Тогда
		ЕстьДоступ = Истина;
	КонецЕсли;
	
	Если Не ЕстьДоступ Тогда
		ПараметрыОтбора = Новый Структура("Должность, Подразделение", Должность, Подразделение);
		ЕстьДоступ = (Статус.КадровыеДанные.НайтиСтроки(ПараметрыОтбора).Количество()>0);
	КонецЕсли;
	
	Если Не ЕстьДоступ Тогда
		ПараметрыОтбора = Новый Структура("Должность, Подразделение", Справочники.ДолжностиОрганизаций.ПустаяСсылка(), Подразделение);
		ЕстьДоступ = (Статус.КадровыеДанные.НайтиСтроки(ПараметрыОтбора).Количество()>0);
	КонецЕсли;
		
	Если Не ЕстьДоступ Тогда
		ПараметрыОтбора = Новый Структура("Должность, Подразделение", Должность, Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
		ЕстьДоступ = (Статус.КадровыеДанные.НайтиСтроки(ПараметрыОтбора).Количество()>0);
	КонецЕсли;
	
	Возврат ЕстьДоступ;
	
КонецФункции

Функция ЕстьЭтапыЗаявки() Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыЗаявки.Код КАК Код
	|ИЗ
	|	Справочник.СтатусыЗаявки КАК СтатусыЗаявки"
	);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ИнициализироватьБазовыеЭтапы() Экспорт
	
	Если ЕстьЭтапыЗаявки() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтапыЗаявки = Новый Массив;
	ЭтапыЗаявки.Добавить(Новый Структура("Код, Наименование, Заголовок", "000", "Отменена"                                ,                            ));
	ЭтапыЗаявки.Добавить(Новый Структура("Код, Наименование, Заголовок", "001", "Формируется"                             , "Отправить в ОМТС"         ));
	ЭтапыЗаявки.Добавить(Новый Структура("Код, Наименование, Заголовок", "002", "Ожидается обработка ОМТС"                ,                            ));
	ЭтапыЗаявки.Добавить(Новый Структура("Код, Наименование, Заголовок", "003", "Расценка ОМТС"                           , "Отправить на согласование"));
	ЭтапыЗаявки.Добавить(Новый Структура("Код, Наименование, Заголовок", "004", "Ожидается согласование главным инженером",                            ));
	ЭтапыЗаявки.Добавить(Новый Структура("Код, Наименование, Заголовок", "005", "На согласовании"                         , "Согласовать"              ));
	ЭтапыЗаявки.Добавить(Новый Структура("Код, Наименование, Заголовок", "006", "В работе ОМТС"                           , "Отправить менеджерам"     ));
	ЭтапыЗаявки.Добавить(Новый Структура("Код, Наименование, Заголовок", "900", "Частично закрыта"                        ,                            ));
	ЭтапыЗаявки.Добавить(Новый Структура("Код, Наименование, Заголовок", "999", "Закрыта"                                 ,                            ));
	
	Для Каждого ЭтапЗаявки Из ЭтапыЗаявки Цикл
		
		НовыйЭлемент = Справочники.СтатусыЗаявки.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭтапЗаявки);
		НовыйЭлемент.Записать();
		
	КонецЦикла;
	
	//-= устанавливаем связи перехода
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыЗаявки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыЗаявки КАК СтатусыЗаявки
	|ГДЕ
	|	НЕ СтатусыЗаявки.Код В (""000"", ""900"", ""999"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыЗаявки.Код УБЫВ"
	);
	
	Следующий = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Следующий <> Неопределено Тогда
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Следующий = Следующий;
			Объект.Записать();
		КонецЕсли;
		
		Следующий = Выборка.Ссылка;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
